
## Plan Result (stg)




<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_storage_share.dets-file-share[0]
* Update
  * azurerm_windows_virtual_machine.modernisation_windows[&#34;stgdartsmidmock&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_storage_share.dets-file-share[0] will be created
  + resource "azurerm_storage_share" "dets-file-share" {
      + access_tier          = (known after apply)
      + enabled_protocol     = "SMB"
      + id                   = (known after apply)
      + metadata             = (known after apply)
      + name                 = "dets-file-share"
      + quota                = 50
      + resource_manager_id  = (known after apply)
      + storage_account_name = "sastgdartsartefacts"
      + url                  = (known after apply)
    }

  # azurerm_windows_virtual_machine.modernisation_windows["stgdartsmidmock"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "modernisation_windows" {
        id                                                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Compute/virtualMachines/stgdartsmidmock"
        name                                                   = "stgdartsmidmock"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (25 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":317,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->